app/controllers/events_controller.rb

  def index
    @events = Event.all
    @events.each do |event|
      if !event.lat && !event.lon
        res = MultiGeocoder.geocode(event.location)
        event.lon = res.lng
        event.lat = res.lat
        event.save
---
SELECT * FROM "events"
UPDATE "events" SET "lon" = 37.6101019, "lat" = 55.7182131, "updated_at" = '2009-04-12 18:49:01' WHERE "id" = 2

  def show
    @event = Event.find(params[:id], :include => :videos)
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("lon", "updated_at", "title", "event_at", "description", "user_id", "published_at", "lat", "created_at", "location") VALUES(NULL, '2009-04-12 18:48:56', 'Хмм', '2009-04-12', '', NULL, '2009-04-12', NULL, '2009-04-12 18:48:56', 'Москва Шаболовка 37')

  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])
---
SELECT * FROM "events" WHERE ("events"."id" = 2)
UPDATE "events" SET "thumbnail" = '1.jpg', "updated_at" = '2009-04-12 19:23:47' WHERE "id" = 2